member
language
lac
essex
september
events
programme
lac
group
nlp
ypa
project
example
data
ypa
techniques
data
look
collaboration
language
fox/poesio/kruschwitz
project
links
watch
space
cdt
iggi
years
epsrc
students
profiles
cdt
email
ktp
project
essex
poesio/kruschwitz
project
detail
lrec
paper
ktp
project
university
signal
timeline
collaboration
miguel
coverage
signal
techcrunch
project
innovateuk
landmark
december
anawiki
epsrc
project
creation
corpora
findings
lessons
phrasedetectives
november
project
example
look
information
autoadapt
project
project
methods
search
behaviour
application
information
scenarios
focus
project
pebl-ai
project
pebl
project
pebl-ai
ccgs
communities
development
jobserve
world
development
aws
ipswich
company
epsrc
ypa
project
karen
jones
irsg
winter
london
co-organiser
co-organiser
acl
evaluation
ecir
organiser
sigir
sirip
ecir
text2story'19
workshop
chiir
wsdm
aaai
uistda
swisstext
ldk
co-organiser
emnlp
sigir
demos
profs2018
sigir
co-chair
airs
games4nlp
co-chair
fdia
hcomp
ictir
chiir
wsdm
cikm
ecir
dir
text2story'18
workshop
newsir'18
workshop
lrec
swisstext
iswc
co-organiser
sigir
fdia
mindtrek
cikm
iswc
games4nlp
ecir
www
eswc
track
multiling
chiir
mmm
co-organiser
gamifir'16
co-organiser
sigir
demos
cikm
workshop
jcdl
ecir
co-organiser
board
wsdm
chiir
ecir
lrec
eswc
co-organiser
multiling
cikm
jcdl
sigir
fdia
gamifir'15
workshop
co-organiser
ecir
aaai
clef
newsreel
committee
eswc
acl
translation
hytra
ranlp
co-organiser
sigir
practice
gamifir'14
workshop
co-organiser
gap
mindthegap'14
co-organiser
iiix
ecir
lrec
eacl
translation
hytra
umap
clef
newsreel
committee
board
mmm
co-chair
aaai
co-organiser
sigir
sigir
bars
sigir
ranlp
ijcnlp
ecir
dir
eswc
aaai
acl
translation
hytra
fdia
co-organiser
sigir
iiix
ecir
ecir
ecir
sir2012
board
eacl
lrec
workshop
styles
stairs
co-organiser
ecir
co-chair
ecir
fdia
www
co-organiser
co-chair
ecir
co-chair
conference
co-organiser
iiix
ecai
stairs
acl
acl
ranlp
minucs
ictir
fdia
nodalida
corpus
workshop
committee
fdia
committee
sigir
ranlp
teaching
ce306/ce706
subject
corrections
gundry
trends
enterprise
review
intranetfocus
newsletter
review
